In [1]:
import numpy as np
import pandas as pd

In [11]:
dict1 = {"Isim":["Ahmet", "Mehmet", "Ayse", "Sena"], 
         "Spor": ["Kosu", "Yuzme", "Kosu", "Tenis"], 
         "Kalori": [100, 150, 200, 100]
        }

In [12]:
dataframe1 = pd.DataFrame(dict1, index = [0, 1, 2, 3])

In [13]:
dataframe1

     Isim   Spor  Kalori
0   Ahmet   Kosu     100
1  Mehmet  Yuzme     150
2    Ayse   Kosu     200
3    Sena  Tenis     100

In [14]:
dict2 = {"Isim":["Zeynep", "Sinem", "Deniz", "Irmak"], 
         "Spor":["Basketbol", "Badminton", "Yuzme", "Futbol"], 
         "Kalori":[300, 400, 500,600]
        }

In [15]:
dataframe2 = pd.DataFrame(dict2, index=[4, 5, 6, 7])

In [16]:
dataframe2

     Isim       Spor  Kalori
4  Zeynep  Basketbol     300
5   Sinem  Badminton     400
6   Deniz      Yuzme     500
7   Irmak     Futbol     600

In [17]:
dict3 = {"Isim":["Fatih", "Salih", "Osman", "Kubra"], 
         "Spor":["Kosu", "Badminton", "Tenis", "Futbol"], 
         "Kalori":[100, 400, 400,300]
        }

In [18]:
dataframe3 = pd.DataFrame(dict3, index=[8, 9, 10, 11])

In [19]:
dataframe3

     Isim       Spor  Kalori
8   Fatih       Kosu     100
9   Salih  Badminton     400
10  Osman      Tenis     400
11  Kubra     Futbol     300

In [20]:
dataframe1

     Isim   Spor  Kalori
0   Ahmet   Kosu     100
1  Mehmet  Yuzme     150
2    Ayse   Kosu     200
3    Sena  Tenis     100

In [21]:
dataframe2

     Isim       Spor  Kalori
4  Zeynep  Basketbol     300
5   Sinem  Badminton     400
6   Deniz      Yuzme     500
7   Irmak     Futbol     600

In [22]:
dataframe3

     Isim       Spor  Kalori
8   Fatih       Kosu     100
9   Salih  Badminton     400
10  Osman      Tenis     400
11  Kubra     Futbol     300

## concatenation

In [26]:
pd.concat([dataframe1, dataframe2, dataframe3], axis=0) # 0 yazmasak da olur, ama bulunsun

      Isim       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yuzme     150
2     Ayse       Kosu     200
3     Sena      Tenis     100
4   Zeynep  Basketbol     300
5    Sinem  Badminton     400
6    Deniz      Yuzme     500
7    Irmak     Futbol     600
8    Fatih       Kosu     100
9    Salih  Badminton     400
10   Osman      Tenis     400
11   Kubra     Futbol     300

## merge

In [27]:
mergeDict1 = {"Isim": ["Ahmet", "Mehmet", "Ayse", "Sena"],
              "Spor": ["Kosu", "Yuzme", "Kosu", "Tenis"]
             }

In [28]:
mergeDataFrame1 = pd.DataFrame(mergeDict1)

In [29]:
mergeDataFrame1

     Isim   Spor
0   Ahmet   Kosu
1  Mehmet  Yuzme
2    Ayse   Kosu
3    Sena  Tenis

In [30]:
mergeDict2 = {"Isim": ["Ahmet", "Mehmet", "Ayse", "Sena"],
              "Kalori": [100, 150, 200, 100]
             }

In [31]:
mergeDataFrame2 = pd.DataFrame(mergeDict2)

In [32]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     150
2    Ayse     200
3    Sena     100

In [33]:
pd.merge(mergeDataFrame1, mergeDataFrame2, on = "Isim") # Hangi parametre üzerinden birleştirme yapacağımızı on ile kontrol ediyoruz

     Isim   Spor  Kalori
0   Ahmet   Kosu     100
1  Mehmet  Yuzme     150
2    Ayse   Kosu     200
3    Sena  Tenis     100

In [34]:
salaryDict = {
    "Isim": ["Ahmet", "Mehmet", "Ayse", "Sena"],
    "Departman": ["Yazilim", "Satis", "Pazarlama", "Yazilim"],
    "Maas": [200, 300, 400, 500]
}

In [35]:
salaryDataFrame = pd.DataFrame(salaryDict)

In [36]:
salaryDataFrame

     Isim  Departman  Maas
0   Ahmet    Yazilim   200
1  Mehmet      Satis   300
2    Ayse  Pazarlama   400
3    Sena    Yazilim   500

In [40]:
salaryDataFrame["Departman"].unique() # sadece tekil olanları getirir bu şekilde

array(['Yazilim', 'Satis', 'Pazarlama'], dtype=object)

In [41]:
salaryDataFrame["Departman"].nunique() # number of unique

3

In [42]:
salaryDataFrame["Departman"].value_counts() # hangi departmandan kaç tane olduğunu görürüz

Yazilim      2
Satis        1
Pazarlama    1
Name: Departman, dtype: int64

In [43]:
def totalSalary(salary):
    return salary * 1.25

In [45]:
salaryDataFrame["Maas"].apply(totalSalary) # Bu şekilde fonksiyon uygulayabiliriz

0    250.0
1    375.0
2    500.0
3    625.0
Name: Maas, dtype: float64

In [46]:
salaryDataFrame.isnull() # Null değer kontrolü yapabiliriz

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [54]:
newData = {
    "Karakter Sinifi": ["AA", "AA", "BB", "BB", "BB"],
    "Karakter Ismi": ["Aabc", "Babc", "Abc", "Bac","Bac" ],
    "Karakter Puan": [10, 9, 7, 8, 9]
}

In [55]:
newDataFrame = pd.DataFrame(newData)

In [56]:
newDataFrame

  Karakter Sinifi Karakter Ismi  Karakter Puan
0              AA          Aabc             10
1              AA          Babc              9
2              BB           Abc              7
3              BB           Bac              8
4              BB           Bac              9

In [60]:
newDataFrame.pivot_table(values="Karakter Puan", index=["Karakter Sinifi", "Karakter Ismi"], aggfunc=np.sum) 
# Yapmasını istediğimiz işlemi func. olarak veriyoruz. values => colunm name, default func.=> ortalamayı alıyor

                               Karakter Puan
Karakter Sinifi Karakter Ismi
AA              Aabc                      10
                Babc                       9
BB              Abc                        7
                Bac                       17